[
  {
    "context": "Я — Алексей (AVick23), создатель экосистемы «Прогресс». Я не просто репетитор, а разработчик собственной системы обучения, которая решает главные проблемы: хаос в материалах и непонятный прогресс. Моя цель — сделать так, чтобы вы не просто выучили код, а научились мыслить системно. Я прошёл путь от хаоса в чатах к созданию инструментов, которые теперь используют другие преподаватели. Ссылка на мою страницу-визитку: https://avick23.github.io/Business-card/[add_button]",
    "keywords": ["кто такой алексей", "преподаватель", "автор системы", "avick23", "создатель прогресса", "опыт преподавания", "о репетиторе", "личный подход", "визитка"]
  },
  {
    "context": "Главная особенность моего обучения — это «Метод выстраданного познания» плюс технология «ПрогрессБот». Вы не просто смотрите лекции, а активно добываете знания. А чтобы мы не потеряли нить обучения, я использую своего бота: он хранит все задания, напоминает о дедлайнах и показывает реальную статистику вашего роста. Это честное партнерство, где мы оба видим результат.[add_button]",
    "keywords": ["философия обучения", "метод выстраданного познания", "подход", "как работает метод", "основы метода", "честное обучение", "прозрачность", "чем отличаетесь"]
  },
  {
    "context": "Многие страдают от хаоса: задания теряются в Telegram, дедлайны забываются, а прогресс неясен. Я решил это созданием «ПрогрессБота». Теперь мои ученики не пишут решения в личку в 23:47. Они отправляют работы через систему, видят сроки и материалы в одном месте. Это экономит нервы и фокусирует внимание на главном — обучении.",
    "keywords": ["проблемы обучения", "хаос", "потерянные задания", "дедлайны", "как вы решаете проблемы", "преимущества системы", "порядок в учебе", "как организовано"]
  },
  {
    "context": "Экосистема «Прогресс» состоит из трёх частей: 1) ПрогрессБот — ваш цифровой ассистент, который хранит материалы и напоминает о сроках. 2) Прогресс+ — объективный рейтинг, где меня можно найти по реальным метрикам, а не по платной рекламе. 3) Сообщество «Причал» — профессиональная среда, которая гарантирует, что я, как ваш преподаватель, не выгорел и полон энергии.[add_button]",
    "keywords": ["экосистема прогресс", "прогресс бот", "прогресс плюс", "причал", "инструменты", "технологии в обучении", "система"]
  },
  {
    "context": "Для родителей и учеников работа через «ПрогрессБот» означает полную прозрачность. Вам больше не нужно верить на слово «мы занимаемся». В любой момент вы можете зайти в раздел «Мой прогресс» и увидеть: сколько заданий выполнено, какие темы освоены, а где есть пробелы. Никаких словесных оправданий, только данные и объективная динамика.[add_button]",
    "keywords": ["для родителей", "прозрачность", "контроль обучения", "статистика для родителей", "как проверить прогресс", "отчеты"]
  },
  {
    "context": "Я преподаю программирование с фокусом на Backend-разработку. Основной язык — Python, но у меня есть дорожные карты для Golang и DevOps. Обучение строится не от теории к практике, а от реальных задач к знаниям. Мы изучаем только то, что нужно для решения конкретной инженерной проблемы. Это экономит время и дает понимание «зачем».[add_button]",
    "keywords": ["что преподает", "предметы", "python", "бэкенд", "golang", "devops", "дорожные карты", "программа обучения"]
  },
  {
    "context": "Я разработал подробные дорожные карты для разработчиков разного уровня: Backend (https://avick23.github.io/roadmap_backend/), Python (https://avick23.github.io/roadmap_python/), Golang (https://avick23.github.io/roadmap_golang/) и DevOps (https://avick23.github.io/roadmap_devops/). Это бесплатный ресурс, который поможет вам сориентироваться в профессии.[add_button]",
    "keywords": ["дорожная карта", "программа", "roadmap", "ссылки на материалы", "бесплатные ресурсы", "где учиться", "с чего начать", "карта развития"]
  },
  {
    "context": "Формат занятий адаптивен. Мы можем заниматься индивидуально или в мини-группах (метод выстраданного познания отлично работает в группах по 3-4 человека). Длительность и стоимость обсуждаются на бесплатной консультации, так как я подбираю темп и программу под конкретного ученика. Главное условие — системность и выполнение заданий через ПрогрессБот.[add_button]",
    "keywords": ["стоимость обучения", "цена урока", "длительность занятия", "формат урока", "сколько стоит", "условия", "группы", "индивидуально"]
  },
  {
    "context": "Полный путь от основ до уровня Middle/Senior занимает 9-12 месяцев при регулярных занятиях. Программа включает 8 этапов обучения с постепенным усложнением. Важно понимать, что это не линейный процесс — темп обучения индивидуален. С помощью аналитики в боте мы всегда видим, когда нужно ускориться или замедлиться.[add_button]",
    "keywords": ["длительность обучения", "сколько длится курс", "9-12 месяцев", "темп обучения", "индивидуальный подход", "реалистичные сроки", "сколько времени"]
  },
  {
    "context": "Я не сторонник стандартных курсов с сертификатами. Моя цель — дать рабочие навыки и портфолио. К концу обучения вы будете иметь не просто знания, а реальную историю в «ПрогрессБоте»: проекты, код, защищенные решения. Это и есть ваше портфолио и конкурентное преимущество на рынке труда.[add_button]",
    "keywords": ["результаты обучения", "портфолио", "сертификат", "реальные навыки", "трудоустройство", "что я получу на выходе", "диплом"]
  },
  {
    "context": "Уже на первом этапе вы создадите консольный калькулятор и анализатор текста. К середине курса — полноценное REST API. В конце — high-performance backend-систему на FastAPI. Эти проекты не просто учебные — они решают реальные задачи и станут основой вашего портфолио для собеседований.[add_button]",
    "keywords": ["практические проекты", "портфолио", "реальные задачи", "REST API", "FastAPI", "микросервисы", "защита проектов", "практические навыки", "что я буду делать"]
  },
  {
    "context": "Если вы чувствуете, что тонете в хаосе самостоятельного обучения, или ваш прошлый репетитор не мог организовать процесс — приходите в «Прогресс». Моя система гарантирует порядок, прозрачность и структуру. Записаться на бесплатную консультацию можно через сайт https://avick23.github.io/Business-card/ или Telegram @AVick23.[add_button]",
    "keywords": ["как записаться", "консультация", "контакты", "telegram", "avick23", "сайт визитка", "начать обучение", "запись"]
  },
  {
    "context": "Подготовка к собеседованиям интегрирована в программу. На этапе продвинутых тем мы проводим специальные сессии: разбор типовых задач, технические интервью в формате «защита решения». Кроме того, ваш финальный проект в боте станет основой для рассказа о вашем опыте.[add_button]",
    "keywords": ["подготовка к собеседованиям", "трудоустройство", "технические интервью", "карьера", "резюме", "как найти работу", "помощь с трудоустройством"]
  },
  {
    "context": "Доступна бесплатная 30-минутная консультация. На ней мы определим ваш текущий уровень, обсудим цели обучения и я покажу, как работает ПрогрессБот на практике. Это идеальная возможность понять, подходит ли вам такой системный подход. Записаться можно через Telegram @AVick23 или страницу визитку.[add_button]",
    "keywords": ["бесплатная консультация", "30 минут", "пробное занятие", "демонстрация метода", "определение уровня", "как записаться", "первая встреча", "хочу попробовать"]
  },
  {
    "context": "Для полноценного освоения материала рекомендуется уделять 6-8 часов в неделю: 2 занятия и 3-4 часа на домашние задания. Однако программа гибкая — в боте вы видите свою нагрузку, и мы можем скорректировать план, если нужно замедлиться на сложных темах. Главное — регулярность.[add_button]",
    "keywords": ["время на обучение", "часов в неделю", "расписание", "домашние задания", "загруженность", "баланс обучения", "гибкий график"]
  },
  {
    "context": "Я знаю, каково это — быть одному в профессии. Поэтому я создал сообщество «Причал». Став моим учеником, вы становитесь частью этой культуры, где ценится обмен опытом и поддержка. Я не бросаю своих студентов — мы остаемся на связи через систему и профессиональный чат.[add_button]",
    "keywords": ["поддержка", "сообщество", "причал", "не один", "помощь студентам", "наставничество", "долгосрочные отношения"]
  },
  {
    "context": "Для меня репетиторство — это не «продажа часов», а создание профессионала. Я не гонюсь за количеством учеников. Мне важно качество результата. Поэтому я использую аналитику: если вижу через бота, что прогресс ученика падает, мы останавливаемся и ищем причину вместе.[add_button]",
    "keywords": ["отношение к ученикам", "качество", "аналитика", "индивидуальный подход", "не для всех", "отличие от школ"]
  },
  {
    "context": "В отличие от онлайн-школ, где вы теряетесь в потоке, или фрилансеров, работающих в чатах, я предлагаю системный подход. У вас есть доступ к «Банку тем», структурированным материалам и истории прогресса. Это экономит время и защищает от забывчивости. Вы всегда знаете, что задано и когда сдать.[add_button]",
    "keywords": ["преимущества", "почему вы", "сравнение со школами", "удобство", "организация", "все в одном месте", "почему стоит выбрать вас"]
  },
  {
    "context": "Если после первых двух недель регулярных занятий вы не увидите прогресса, я верну вам деньги. Гарантия работает при условии посещения занятий и выполнения заданий в боте. Такая гарантия возможна потому, что система «Прогресс» показывает результаты уже через несколько занятий — студенты начинают мыслить как разработчики.[add_button]",
    "keywords": ["гарантия возврата", "две недели", "условия гарантии", "результаты обучения", "финансовая защита", "качество обучения", "что если не понравится", "гарантии"]
  },
  {
    "context": "К концу курса вы освоите ключевые навыки: разработку REST API, работу с базами данных, асинхронное программирование, тестирование и деплой. Эти навыки соответствуют требованиям для позиции Junior/Middle Python-разработчика и дают прочную основу для роста.[add_button]",
    "keywords": ["навыки разработчика", "результат обучения", "junior разработчик", "rest api", "базы данных", "асинхронное программирование", "карьерные перспективы", "чему я научусь"]
  },
  {
    "context": "Вопросы вне учебного времени можно задавать через Telegram (@AVick23) или в закрытом чате студентов. Ответы на технические вопросы обычно приходят в течение 24 часов. Для срочных вопросов предусмотрен приоритетный канал связи.",
    "keywords": ["вопросы вне занятий", "поддержка", "telegram", "@AVick23", "закрытый чат", "24 часа", "техническая поддержка", "как задать вопрос"]
  },
  {
    "context": "После окончания курса вы получаете бессрочный доступ к материалам в боте. Я поддерживаю выпускников: отвечаю на вопросы, даю рекомендации и приглашаю на специальные сессии по новым технологиям. Это не просто курс — это вход в профессиональное сообщество.[add_button]",
    "keywords": ["поддержка после курса", "бессрочный доступ", "профессиональное сообщество", "закрытый чат выпускников", "карьерные консультации", "что после курса", "продолжение обучения"]
  },
  {
    "context": "В курсе используются профессиональные инструменты: VS Code, Git, Docker, Postman. Все инструменты бесплатны и широко применяются в индустрии. Это позволяет студентам сразу привыкнуть к реальному рабочему окружению разработчика.",
    "keywords": ["инструменты курса", "vs code", "git", "docker", "postman", "рабочее окружение", "профессиональные инструменты", "что нужно установить"]
  },
  {
    "context": "Даже если вы пропустите занятие, вы не потеряете прогресс. Все материалы доступны в текстовом формате в ПрогрессБоте. Для пропущенных уроков можно разобрать тему самостоятельно с последующей консультацией. Групповая динамика построена так, что пропуск одного занятия не помешает пониманию следующих тем.[add_button]",
    "keywords": ["пропустил занятие", "пропуски", "дополнительные занятия", "материалы для самостоятельного изучения", "гибкость", "догнать программу"]
  },
  {
    "context": "Для начала курса не требуется специальной подготовки. Достаточно базового понимания компьютера. Курс начинается с самых основ: переменных, циклов — всё объясняется через простые аналогии и практические примеры в боте. Главное — ваше стремление развиваться.[add_button]",
    "keywords": ["требования к студентам", "начальный уровень", "нулевой опыт", "подготовка к курсу", "для начинающих", "базовые знания", "старт без опыта", "можно ли с нуля"]
  },
  {
    "context": "Группы по 3-4 человека — это научно обоснованный стандарт эффективности. В таких мини-группах нет места «социальной лени» (эффект Рингельмана), когда кто-то отсиживается за спинами других. Каждый студент вынужден быть активным: защищать решение, спорить, объяснять. В процессе дебатов рождается истинное понимание, которое невозможно получить при пассивном прослушивании лекции.",
    "keywords": ["размер группы", "группы по 3-4 человека", "оптимальный размер", "научное обоснование", "эффективность обучения", "эффект рингельмана", "маленькие группы", "командная работа"]
  },
  {
    "context": "Родители часто спрашивают: «Как мне понять, что ребенок реально занимается, а не просто сидит в телефоне?». Мой ответ: через «ПрогрессБот». У родителя (по запросу) есть доступ к статистике. Вы видите не просто «было занятие», а конкретные цифры: сколько задач решено, какой процент просрочек, какие темы вызывают сложность. Это снимает необходимость контролировать каждый шаг — система прозрачна.",
    "keywords": ["для родителей", "контроль родителей", "прозрачность", "статистика для родителей", "как проверить ребенка", "понимание прогресса"]
  },
  {
    "context": "В процессе обучения мы используем «Ротацию ролей». На одном занятии вы Тимлид, на другом — Критик или Архитектор. Это позволяет примерить на себя разные грани IT-профессии. Кто-то оказывается отличным оратором, кто-то гениально ищет баги. Это помогает не только учить код, но и лучше понять, кем именно вы хотите работать в IT.",
    "keywords": ["роли в группе", "тимлид", "критик", "архитектор", "soft skills", "командная работа", "профессиональное самоопределение", "как проходят занятия"]
  },
  {
    "context": "В курсе практически нет «чистой теории». Даже фундаментальные концепции объясняются через практику. ООП (Объектно-ориентированное программирование) мы изучаем, создавая игру, а асинхронность — разрабатывая телеграм-бота, который должен отвечать тысячам пользователей одновременно. Теория закрепляется мгновенно, а не откладывается «на потом».[add_button]",
    "keywords": ["теория и практика", "баланс", "практическое применение", "конкретные примеры", "ооп", "асинхронность", "сколько теории", "будет ли много теории"]
  },
  {
    "context": "Страх «Я не справлюсь, я гуманитарий» — один из самых частых. Мой метод выстраданного познания доказывает обратное. Программирование — это не математика высшего уровня, а логика и язык. Если вы можете построить логическую цепочку в споре или написать инструкцию, вы сможете программировать. Я подбираю задачи в «зоне ближайшего развития», чтобы вы чувствовали рост, а не стресс.",
    "keywords": ["гуманитарий", "не математический склад", "страх не справиться", "сложно ли учиться", "нужна ли математика", "может ли гуманитарий", "для кого курс"]
  },
  {
    "context": "Многие спрашивают про разницу с курсами вроде Skillbox или GeekBrains. Главное отличие: там вы — «винтик» в конвейере, а у меня — партнер в системном обучении. Я не продаю видеоуроки, я даю структуру (Бот), среду (Причал) и метод (выстраданное познание). Вы платите не за просмотр контента, а за результат и менторство, которое адаптируется под вас.",
    "keywords": ["сравнение с курсами", "skillbox", "geekbrains", "онлайн школы", "чем отличаетесь", "сравнение цен", "что лучше", "плюсы и минусы"]
  },
  {
    "context": "Что если я пропущу занятие? В отличие от классных часов, у меня работает система «Банка тем». Вы можете взять пропущенную тему в формате самостоятельного исследования, и мы разберем её защиту индивидуально или на следующем созвоне. Материалы остаются в боте навсегда, так что догнать программу проще, чем кажется.",
    "keywords": ["пропуск занятия", "что если пропущу", "болезнь", "отпуск", "догнать программу", "гибкость", "пропуски"]
  },
  {
    "context": "Я преподаю на Python, потому что это язык, который «прощает» ошибки новичка, но масштабируется до гигантских систем. Вы начнете с простых скриптов, а закончите построением микросервисной архитектуры на FastAPI. Python открывает двери в Web, Data Science, Automation и AI — это универсальный фундамент для карьеры.",
    "keywords": ["почему python", "перспективы python", "для чего python", "популярность языка", "где используется", "выбор языка", "первый язык"]
  },
  {
    "context": "В курсе мы активно используем Git и GitHub. Это не просто «сохранение файлов», а стандарт индустрии. С первого занятия вы учитесь вести историю изменений, работать с ветками и пулл-реквестами. Уже через месяц у вас будет оформленный профиль на GitHub, который круче, чем любой сертификат.",
    "keywords": ["git", "github", "портфолио", "как сохранять код", "инструменты", "gitlab", "контроль версий", "что будет в профиле"]
  },
  {
    "context": "Подготовка к собеседованиям встроена в ДНК обучения. Защита решений перед группой — это и есть тренировка технического интервью. Вы учитесь говорить о коде, оправдывать свои решения и слышать критику. На последних этапах мы разбираем типовые задачи с LeetCode и проводим симуляции собеседований с разбором «слабых мест».",
    "keywords": ["собеседование", "интервью", "leetcode", "алгоритмы", "подготовка к найму", "как проходят интервью", "тренировка"]
  },
  {
    "context": "Стоит ли идти в IT сейчас, когда везде ChatGPT? Однозначно да. ИИ — это инструмент, который ускоряет работу профи, но не заменяет того, кто умеет ставить задачи и строить архитектуру. В курсе я учу не просто «писать код», а «думать как инженер» и использовать ИИ как мощный ускоритель, а не как замену мозгам.",
    "keywords": ["ит сейчас", "кризис ит", "chatgpt", "нейросети", "будущее профессии", "заменят ли программистов", "актуальность", "перспективы"]
  },
  {
    "context": "Для школьников, готовящихся к ОГЭ/ЕГЭ по информатике, мой курс — лучшая инвестиция. Вместо натаскивания на типовые задания ЕГЭ мы разбираем суть. Если вы понимаете, как работает память, циклы и алгоритмы, экзаменационные задачи решаются интуитивно. Многие мои ученики сдают экзамены на 90+ баллов, не тратя лишние часы на зубрежку.",
    "keywords": ["егэ информатика", "огэ", "подготовка к экзаменам", "школьники", "сдать экзамен", "помощь с экзаменом", "информатика"]
  },
  {
    "context": "Да, я выдаю справки и подтверждающие документы для студентов (например, для налоговых вычетов или по месту учебы), так как работаю официально как самозанятый. Все транзакции прозрачны, чеки формируются автоматически.",
    "keywords": ["документы", "справка", "официально", "договор", "чеки", "самозанятый", "для налоговой"]
  },
  {
    "context": "Ваше портфолио к концу курса будет состоять из 5-7 серьезных проектов. Это не «Hello World», а работающие системы: телеграм-бот с базой данных, API для блога, парсер данных, система мониторинга. В резюме вы указываете ссылку на GitHub, где работодатель видит живой код, коммиты и документацию — это мощный аргумент при найме.[add_button]",
    "keywords": ["портфолио", "github", "резюме", "проекты", "что будет в резюме", "примеры работ", "как выглядит портфолио"]
  },
  {
    "context": "Если через 2 недели вы поймете, что метод не подходит, я верну деньги без лишних вопросов. Главное условие — вы пытались заниматься, а не просто «смотрели». Моя репутация и прозрачная система рейтингов Прогресс+ важнее разовой оплаты. Я хочу учеников, которым здесь комфортно.",
    "keywords": ["возврат денег", "гарантия", "если не понравится", "финансовые гарантии", "риск", "безопасность"]
  },
  {
    "context": "В работе используется операционная система, комфортная вам (Windows, macOS или Linux). Однако я рекомендую освоить базовые команды терминала (Linux), так как серверы, на которых будет жить ваш код в будущем, почти всегда работают на Linux. Это ключевой навык для Backend-разработчика.",
    "keywords": ["какая ос", "windows или linux", "mac", "операционная система", "терминал", "linux для новичка"]
  },
  {
    "context": "Я активно использую обратную связь. В боте есть возможность оставить комментарий к каждому заданию. Но главное — это рефлексия в конце каждого занятия (5 минут), где мы проговариваем: что было сложно, что понятно, что хочется повторить. Это делает обучение двусторонним процессом.",
    "keywords": ["обратная связь", "как давать фидбек", "рефлексия", "взаимодействие", "комментарии", "сложности"]
  },
  {
    "context": "Для студентов, которые хотят заниматься Data Science, мой курс Backend-разработки — это фундамент. Прежде чем анализировать данные, нужно научиться их получать, хранить и обрабатывать. Мы даем навыки работы с базами данных и API, которые критически важны для Data Engineering.",
    "keywords": ["data science", "дата сайенс", "анализ данных", " машинное обучение", "нужно ли backend", "куда расти дальше"]
  },
  {
    "context": "Стажировки. У меня есть партнерские связи с небольшими IT-компаниями. Лучших выпускников, у которых на руках готовые проекты и высокая активность в боте, я рекомендую напрямую. Работодатели ценят «боевой опыт» защиты решений больше, чем красивые дипломы вузов.",
    "keywords": ["стажировка", "трудоустройство", "помощь с работой", "партнеры", "связи", "рекомендации"]
  },
  {
    "context": "Вопрос времени: «Я работаю 5/2, смогу ли я учиться?». Да, но дисциплина решает всё. Занятия мы подбираем под ваш график (вечер или выходные). Домашние задания в боте структурированы так, что их можно делать кусочками по 20-30 минут. Успех зависит не от количества свободных часов, а от постоянства.",
    "keywords": ["работа и учеба", "график", "совмещение", "занятость", "можно ли работающим", "вечерние занятия", "выходные"]
  },
  {
    "context": "В отличие от репетиторов-одиночек, у которых всё держится на личной памяти и чатиках, я предоставляю инфраструктуру. Если я заболею или уеду в отпуск, материалы и прогресс учеников не исчезнут — они надежно хранятся в системе. Обучение не прерывается, оно системно.",
    "keywords": ["надежность", "если репетитор пропадет", "преемственность", "система", "архив данных", "безопасность данных"]
  },
  {
    "context": "В сообществе «Причал» действуют правила человечности: нельзя язвить, «поучать» или рекламироваться. Это безопасное пространство. Если студенту нужна моральная поддержка или совет по жизни, он получит его здесь. Это снижает уровень выгорания, который так част у айтишников.",
    "keywords": ["причал", "атмосфера", "поддержка", "психология", "выгорание", "правила сообщества", "безопасность"]
  },
  {
    "context": "Английский язык? Код пишется на английском, но обучение проходит на русском. Однако я советую подтягивать технический английский параллельно, так как документация к новым библиотекам почти всегда выходит на английском. В боте я указываю термины на двух языках для привыкания.",
    "keywords": ["английский", "знание языка", "нужен ли английский", "без английского", "документация", "термины"]
  },
  {
    "context": "Если у вас нет ноутбука, но есть мощный ПК — это нормально. Главное — стабильный интернет и возможность запускать код. Для самых слабых ноутбуков мы учим работать с облачными серверами, где код крутится удаленно. Железо не должно быть преградой для знаний.",
    "keywords": ["компьютер", "ноутбук", "какой пк нужен", "железо", "требования к железу", "слабый ноутбук"]
  },
  {
    "context": "Как определить прогресс на полпути? Мы проводим промежуточную «калибровку» после 4 этапа. Это проверка навыков: вы получаете незнакомую задачу, решение которой не разжевывали на уроке. Умение найти путь решения в незнакомой ситуации — главный маркер того, что вы растете.",
    "keywords": ["промежуточный контроль", "экзамен", "проверка знаний", "как понять рост", "срез знаний", "тестирование"]
  }

]